IDEA StatiCa Open Model
ConnectionData Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Provides data of the connection
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.ConnectionData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectionData
Public Class ConnectionData
public ref class ConnectionData
The ConnectionData type exposes the following members.
Constructors
Name | Description
ConnectionData
Initializes a new instance of the ConnectionData class
Top
Properties
Name | Description
AnchorGrids
 Anchor grids which belongs to the connection
Beams
 Connected beams
BoltGrids
 Bolt grids which belongs to the connection
ConcreteBlocks
 ConcreteBlocksof the connection
CutBeamByBeams
 cut beam by beams
FoldedPlates
 Folded plate of the connection
Plates
 Plates of the connection
Welds
 Welds of the connection
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace